//====================================================================
//
// 入力処理 (input.cpp)
// Author : 伊藤陽梧
//
//====================================================================

//========================
// インクルードファイル
//========================
#include "input.h"

//*****************************************************************************
// Joypad用設定値
//*****************************************************************************
#define DEADZONE        2500            // 各軸の25%を無効ゾーンとする
#define RANGE_MAX       10000           // 有効範囲の最大値
#define RANGE_MIN       -10000          // 有効範囲の最小値

//========================================
// 静的メンバ変数宣言
//========================================
LPDIRECTINPUT8 CInput::m_pInput = NULL;

//========================================
// 入力のデフォルトコンストラクタ
//========================================
CInput::CInput()
{
	m_pDevice = NULL;
}

//========================================
// 入力のデストラクタ
//========================================
CInput::~CInput()
{

}

//========================================
// 入力の初期化処理
//========================================
HRESULT CInput::Init(HINSTANCE hInstance, HWND hWnd)
{
	// すでに作ったかどうか判別
	if (m_pInput == NULL)
	{
		// DirectInputオブジェクトの作成
		if (FAILED(DirectInput8Create(hInstance, DIRECTINPUT_VERSION, IID_IDirectInput8, (void**)&m_pInput, NULL)))
		{
			return E_FAIL;
		}
	}
	else
	{
		return E_FAIL;
	}

	return S_OK;
}

//========================================
// 入力の終了処理
//========================================
void CInput::Uninit(void)
{
	// 入力デバイス(キーボード)の開放
	if (m_pDevice != NULL)
	{
		// キーボードのアクセス権を開放(入力制御終了)
		m_pDevice->Unacquire();
		m_pDevice->Release();
		m_pDevice = NULL;
	}

	// Directinputオブジェクトの開放
	if (m_pInput != NULL)
	{
		m_pInput->Release();
		m_pInput = NULL;
	}
}